       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      ***************************************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = MONTIVAL JUNIOR
      * OBJETIVO = MOSTRAR A STRING HELLO WORLD
      * DATA = 14/10/2020
      ***************************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD'.
           STOP RUN.
